HTRamsey/STM32_ETH_Test/Libs/FreeRTOS-Plus-TCP/portable/NetworkInterface.c
    if( xFound == pdTRUE )
    {
        ETH_HandleTypeDef * pxEthHandle = &xEthHandle;
        ETH_MACFilterConfigTypeDef xFilterConfig;
        ( void ) HAL_ETH_GetMACFilterConfig( pxEthHandle, &xFilterConfig );

    }
}

#endif

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                              EMAC Task                                    */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

static BaseType_t prvNetworkInterfaceInput( ETH_HandleTypeDef * pxEthHandle, NetworkInterface_t * pxInterface )
{
    BaseType_t xResult = pdFALSE;
    UBaseType_t uxCount = 0;
	#if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
		NetworkBufferDescriptor_t * pxStartDescriptor = NULL;
		NetworkBufferDescriptor_t * pxEndDescriptor = NULL;
	#endif
	NetworkBufferDescriptor_t * pxCurDescriptor = NULL;
    if( ( xMacInitStatus == eMacInitComplete ) && ( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_STARTED ) )
    {
		while( HAL_ETH_ReadData( pxEthHandle, ( void ** ) &pxCurDescriptor ) == HAL_OK )
		{
			++uxCount;
			if( pxCurDescriptor == NULL )
			{
				/* Buffer was dropped, ignore packet */
				continue;
			}
			configASSERT( pxEthHandle->RxDescList.RxDataLength <= niEMAC_DATA_BUFFER_SIZE );

			pxCurDescriptor->pxInterface = pxInterface;
			pxCurDescriptor->pxEndPoint = FreeRTOS_MatchingEndpoint( pxCurDescriptor->pxInterface, pxCurDescriptor->pucEthernetBuffer );
			#if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
				if( pxStartDescriptor == NULL )
				{
					pxStartDescriptor = pxCurDescriptor;
				}
				else if( pxEndDescriptor != NULL )
				{
					pxEndDescriptor->pxNextBuffer = pxCurDescriptor;
				}
				pxEndDescriptor = pxCurDescriptor;
			#else
				prvSendRxEvent( pxCurDescriptor );
			#endif
		}
    }

    if( uxCount > 0 )
    {
        #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
            prvSendRxEvent( pxStartDescriptor );
        #endif
        xResult = pdTRUE;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static portTASK_FUNCTION( prvEMACHandlerTask, pvParameters )
{
    NetworkInterface_t * pxInterface = ( NetworkInterface_t * ) pvParameters;
    ETH_HandleTypeDef * pxEthHandle = &xEthHandle;
    EthernetPhy_t * pxPhyObject = &xPhyObject;

    /* iptraceEMAC_TASK_STARTING(); */

    for( ;; )
    {
        BaseType_t xResult = pdFALSE;
        uint32_t ulISREvents = 0U;

        if( xTaskNotifyWait( 0U, eMacEventAll, &ulISREvents, pdMS_TO_TICKS( niEMAC_TASK_MAX_BLOCK_TIME_MS ) ) == pdTRUE )
        {
            if( ( ulISREvents & eMacEventRx ) != 0 )
            {
                xResult = prvNetworkInterfaceInput( pxEthHandle, pxInterface );
            }

            if( ( ulISREvents & eMacEventTx ) != 0 )
            {
                if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( niEMAC_TX_MAX_BLOCK_TIME_MS ) ) != pdFALSE )
                {
                    ( void ) HAL_ETH_ReleaseTxPacket( pxEthHandle );
                    ( void ) xSemaphoreGive( xTxMutex );
                }
            }

            if( ( ulISREvents & eMacEventErrRx ) != 0 )
            {
            	xResult = prvNetworkInterfaceInput( pxEthHandle, pxInterface );
            }

            if( ( ulISREvents & eMacEventErrTx ) != 0 )
            {
                if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( niEMAC_TX_MAX_BLOCK_TIME_MS ) ) != pdFALSE )
                {
                    ( void ) HAL_ETH_ReleaseTxPacket( pxEthHandle );
                    ( void ) xSemaphoreGive( xTxMutex );
                }
            }

            if( ( ulISREvents & eMacEventErrEth ) != 0 )
            {
				configASSERT( ( HAL_ETH_GetError( pxEthHandle ) & HAL_ETH_ERROR_PARAM ) == 0 );
				if( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_ERROR )
				{
					/* Recover from critical error */
					( void ) HAL_ETH_Init( pxEthHandle );
					( void ) HAL_ETH_Start_IT( pxEthHandle );
					xResult = prvNetworkInterfaceInput( pxEthHandle, pxInterface );
				}
            }

            /* if( ( ulISREvents & eMacEventErrMac ) != 0 ) */
            /* if( ( ulISREvents & eMacEventErrDma ) != 0 ) */
        }

        if( xPhyCheckLinkStatus( pxPhyObject, xResult ) != pdFALSE )
        {
            if( prvGetPhyLinkStatus( pxInterface ) != pdFALSE )
            {
            	if( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_ERROR )
				{
            		/* Recover from critical error */
					( void ) HAL_ETH_Init( pxEthHandle );
				}
                if( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_READY )
                {
                    /* Link was down or critical error occurred */
                    if( prvMacUpdateConfig( pxEthHandle, pxPhyObject ) != pdFALSE )
                    {
                        ( void ) HAL_ETH_Start_IT( pxEthHandle );
                    }
                }
            }
            else
            {
                ( void ) HAL_ETH_Stop_IT( pxEthHandle );
                /* TODO: does this need to be cleared? also, make releasing a helper */
                ( void ) memset( &pxEthHandle->Init.TxDesc, 0, sizeof( pxEthHandle->Init.TxDesc ) );
                if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( niEMAC_TX_MAX_BLOCK_TIME_MS ) ) != pdFALSE )
				{
					( void ) HAL_ETH_ReleaseTxPacket( pxEthHandle );
					( void ) xSemaphoreGive( xTxMutex );
				}
                #if ( ipconfigIS_ENABLED( ipconfigSUPPORT_NETWORK_DOWN_EVENT ) )
                    FreeRTOS_NetworkDown( pxInterface );
                #endif
            }
        }
    }
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvEMACTaskStart( NetworkInterface_t * pxInterface )
{
    BaseType_t xResult = pdFALSE;

    if( xTxMutex == NULL )
    {
        #if ipconfigIS_ENABLED( configSUPPORT_STATIC_ALLOCATION )
            static StaticSemaphore_t xTxMutexBuf;
            xTxMutex = xSemaphoreCreateMutexStatic( &xTxMutexBuf );
        #else
            xTxMutex = xSemaphoreCreateMutex();
        #endif
        configASSERT( xTxMutex != NULL );
        vQueueAddToRegistry( xTxMutex, niEMAC_TX_MUTEX_NAME );
    }

    if( xEMACTaskHandle == NULL && ( xTxMutex != NULL ) )
    {
        #if ipconfigIS_ENABLED( configSUPPORT_STATIC_ALLOCATION )
            static StackType_t uxEMACTaskStack[ niEMAC_TASK_STACK_SIZE ];
            static StaticTask_t xEMACTaskTCB;
            xEMACTaskHandle = xTaskCreateStatic(
                prvEMACHandlerTask,
                niEMAC_TASK_NAME,
                niEMAC_TASK_STACK_SIZE,
                ( void * ) pxInterface,
                niEMAC_TASK_PRIORITY,
                uxEMACTaskStack,
                &xEMACTaskTCB
            );
        #else
            ( void ) xTaskCreate(
                prvEMACHandlerTask,
                niEMAC_TASK_NAME,
                niEMAC_TASK_STACK_SIZE,
                ( void * ) pxInterface,
                niEMAC_TASK_PRIORITY,
                &xEMACTaskHandle
            );
        #endif
    }

    if( xEMACTaskHandle != NULL )
    {
        xResult = pdTRUE;
    }

    return xResult;
}

